one_connection/data/one_conn_test2.txt
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.649 ms
initial connection time = 2.456 ms
tps = 606.592824 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.985 ms
initial connection time = 10.587 ms
tps = 503.769312 (without initial connection time)