one_connection/data/one_conn_test256.txt
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.699 ms
initial connection time = 4.404 ms
tps = 588.511897 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.902 ms
initial connection time = 4.107 ms
tps = 525.833950 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.278 ms
initial connection time = 1.907 ms
tps = 782.444836 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.267 ms
initial connection time = 3.645 ms
tps = 789.565081 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.246 ms
initial connection time = 6.515 ms
tps = 802.356269 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.215 ms
initial connection time = 8.688 ms
tps = 822.907384 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.243 ms
initial connection time = 2.548 ms
tps = 804.702429 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.150 ms
initial connection time = 2.602 ms
tps = 869.646882 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.135 ms
initial connection time = 9.581 ms
tps = 880.834846 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.111 ms
initial connection time = 3.146 ms
tps = 900.364673 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.129 ms
initial connection time = 5.739 ms
tps = 885.974864 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 1000000
number of transactions actually processed: 1000000/1000000
number of failed transactions: 0 (0.000%)
latency average = 1.370 ms
initial connection time = 6.499 ms
tps = 729.719158 (without initial connection time)